#+TITLE: ALB with a gRPC Target
#+SETUPFILE: ../setup.org

#+begin_src yaml
AWSTemplateFormatVersion: 2010-09-09
Description: A public ALB with a gRPC target.
Transform: AWS::Serverless-2016-10-31
#+end_src

* Testing

Send an HTTP GET request to the ALB.

#+begin_src sh :tangle no :results output
  alb=$(aws cloudformation list-exports \
      --query "Exports[?Name=='cf-ALB'].Value" \
      --output text)
  curl http://$alb
#+end_src

#+RESULTS:
: {"hello": "world"}
